In [1]:
import numpy as np
import pandas as pd

In [2]:
DATA_PATH = '../data'

# Reading and writing data

Reading CSV data from `../data/raw/steamcharts.csv`

Util write params:
- `usecols=[...]` → read some columns
- `dtype={'col1': 'int64', 'col2': 'category'}` → force data types
- `parse_dates=['col_data']` → auto convert columns in datetime
- `nrows=1000` → read just first N rows
- `chunksize=100000` → streaming file read

In [3]:
data = pd.read_csv(f'{DATA_PATH}/raw/steamcharts.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612265 entries, 0 to 612264
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   month         612265 non-null  object
 1   avg_players   612265 non-null  float64
 2   gain          612265 non-null  object
 3   gain_percent  612265 non-null  float64
 4   peak_players  612265 non-null  int64
 5   name          612265 non-null  object
 6   steam_appid   612265 non-null  int64
dtypes: float64(2), int64(2), object(3)
memory usage: 32.7+ MB

In [4]:
head = data.head()
head

,month,avg_players,gain,gain_percent,peak_players,name,steam_appid
0,Sep-25,7805.25,883.12,0.1276,13254,Counter-Strike,10
1,Aug-25,6922.13,-449.35,-0.0610,12168,Counter-Strike,10
2,Jul-25,7371.48,-833.5,-0.1016,13951,Counter-Strike,10
3,Jun-25,8204.98,-847.53,-0.0936,15798,Counter-Strike,10
4,May-25,9052.51,-471.31,-0.0495,15333,Counter-Strike,10

Writing data on `../data/processed/steamcharts.csv`.

| Format       | Read function     | Write function | Observation                          |
| ------------- | --------------------- | ----------------- | ------------------------------------ |
| Excel (.xlsx) | `pd.read_excel()`     | `to_excel()`      | Requer `openpyxl`                    |
| JSON          | `pd.read_json()`      | `to_json()`       | Pode usar `orient='records'` p/ APIs |
| Feather       | `pd.read_feather()`   | `to_feather()`    | Super rápido (binário, usa Arrow)    |
| Pickle        | `pd.read_pickle()`    | `to_pickle()`     | Armazena objetos Python diretamente  |
| SQL           | `pd.read_sql()`       | `to_sql()`        | Integra com SQLite, Postgres, etc.   |
| HTML          | `pd.read_html()`      | —                 | Extrai tabelas de páginas web        |
| Clipboard     | `pd.read_clipboard()` | `to_clipboard()`  | Muito útil p/ testes rápidos         |

In [5]:
# head.to_csv(f'{DATA_PATH}/processed/steamcharts.csv', index=False)
# head.to_excel(f'{DATA_PATH}/processed/steamcharts.xlsx', index=False)
# head.to_parquet(f'{DATA_PATH}/processed/steamcharts.parquet', index=False, engine='fastparquet')
# head.to_json(f'{DATA_PATH}/processed/steamcharts_records.json', orient='records', lines=False, index=False)

# Data cleaning

In [6]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 2, np.nan, 4],
    'C': [1, 2, 3, 4],
})

df

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  NaN  3
3  4.0  4.0  4

`DataFrame.dropna()` remove lines or columns with NaN values.

Params:
- `DataFrame.dropna(how='all')` -> remove just lines there is totaly NaN values.
- `DataFrame.dropna(subset=['col1', 'col2'])` -> remove lines with NaN value just in specified columns
- `DataFrame.dropna(axis=1)` -> remove columns with NaN value

In [7]:
df_dropna = df.dropna()
df_dropna

     A    B  C
1  2.0  2.0  2
3  4.0  4.0  4

In [8]:
df = pd.DataFrame({
    'A': [np.nan, 2, np.nan, 4],
    'B': [np.nan, 2, np.nan, 4],
    'C': [np.nan, 2, 3, 4],
})

df

     A    B    C
0  NaN  NaN  NaN
1  2.0  2.0  2.0
2  NaN  NaN  3.0
3  4.0  4.0  4.0

In [9]:
df_dropna_how_all = df.dropna(how='all')
df_dropna_how_all

     A    B    C
1  2.0  2.0  2.0
2  NaN  NaN  3.0
3  4.0  4.0  4.0

In [10]:
df_dropna_subset = df.dropna(subset=['C'])
df_dropna_subset

     A    B    C
1  2.0  2.0  2.0
2  NaN  NaN  3.0
3  4.0  4.0  4.0

In [11]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [10, 20, np.nan, 30],
    'C': [100, 200, 300, 400],
    'D': [1000, np.nan, np.nan, np.nan],
})

df

   A     B    C       D
0  1  10.0  100  1000.0
1  2  20.0  200     NaN
2  3   NaN  300     NaN
3  4  30.0  400     NaN

In [12]:
df_dropna_axis1 = df.dropna(axis=1)
df_dropna_axis1

   A    C
0  1  100
1  2  200
2  3  300
3  4  400

`fillna()` -> fill NaN values with an specific value received in the param(mean, median, etc)

In [13]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [5, 6, np.nan, 8],
    'C': [9, 10, 11, 12],
    'D': [13, 14, 15, 16]
})

df

   A    B   C   D
0  1  5.0   9  13
1  2  6.0  10  14
2  3  NaN  11  15
3  4  8.0  12  16

In [14]:
df_fillna = df.fillna(0)
df_fillna

   A    B   C   D
0  1  5.0   9  13
1  2  6.0  10  14
2  3  0.0  11  15
3  4  8.0  12  16

In [15]:
df_fillna_mean = df.copy()
df_fillna_mean['B'] = df['B'].fillna(df['B'].mean())
df_fillna_mean

   A         B   C   D
0  1  5.000000   9  13
1  2  6.000000  10  14
2  3  6.333333  11  15
3  4  8.000000  12  16

`ffill()` -> fill NaN value with the foward value in the same column

In [16]:
df_fillna_ffill = df.ffill()
df_fillna_ffill

   A    B   C   D
0  1  5.0   9  13
1  2  6.0  10  14
2  3  6.0  11  15
3  4  8.0  12  16

`bfill()` -> fill NaN value with the backward value in the same column

In [17]:
df_fill_bfill = df.bfill()
df_fill_bfill

   A    B   C   D
0  1  5.0   9  13
1  2  6.0  10  14
2  3  8.0  11  15
3  4  8.0  12  16

`map()` -> apply a function or an element by element dict in a serie

In [18]:
df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'city': ['New York', 'Los Angeles', 'Chicago'],
    'married': ['Yes', 'No', 'yEs']
})

df

      name         city married
0    Alice     New York     Yes
1      Bob  Los Angeles      No
2  Charlie      Chicago     yEs

In [19]:
df_map_lambda = df.map(lambda x: x.strip().lower())
df_map_lambda

      name         city married
0    alice     new york     yes
1      bob  los angeles      no
2  charlie      chicago     yes

In [20]:
df_map_yes_no = df_map_lambda.copy()
df_map_yes_no['married'] = df_map_yes_no['married'].map({'yes': 1, 'no': 0})
df_map_yes_no

      name         city  married
0    alice     new york        1
1      bob  los angeles        0
2  charlie      chicago        1

`apply()` -> apply a function on each line or column

In [21]:
df = pd.DataFrame({
    'price': [100, 105, 100],
    'quantity': [1, 2, 3]
})  

df

   price  quantity
0    100         1
1    105         2
2    100         3

In [22]:
df_apply = df.copy()
df_apply['total'] = df_apply.apply(lambda row: row['price'] * row['quantity'], axis=1)

df_apply

   price  quantity  total
0    100         1    100
1    105         2    210
2    100         3    300

# Groups and merge

In [23]:
df = pd.DataFrame({
    'game': ['CS2', 'CS2', 'Dota 2', 'Dota 2', 'Apex Legends'],
    'month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan'],
    'avg_players': [100_000, 120_000, 90_000, 110_000, 80_000]
})

df

           game month  avg_players
0           CS2   Jan       100000
1           CS2   Feb       120000
2        Dota 2   Jan        90000
3        Dota 2   Feb       110000
4  Apex Legends   Jan        80000

In [24]:
df.groupby('game')['avg_players'].sum()

game
Apex Legends     80000
CS2             220000
Dota 2          200000
Name: avg_players, dtype: int64

In [25]:
df.groupby('game').size()

game
Apex Legends    1
CS2             2
Dota 2          2
dtype: int64

In [26]:
games = pd.DataFrame({
    'steam_appid': [10, 20, 30],
    'name': ['CS2', 'Dota 2', 'Apex Legends']
})

games

   steam_appid          name
0           10           CS2
1           20        Dota 2
2           30  Apex Legends

In [27]:
stats = pd.DataFrame({
    'steam_appid': [10, 20, 30],
    'avg_players': [110000, 95000, 5000]
})

stats

   steam_appid  avg_players
0           10       110000
1           20        95000
2           30         5000

In [28]:
pd.merge(games, stats, on='steam_appid', how='left')

   steam_appid          name  avg_players
0           10           CS2       110000
1           20        Dota 2        95000
2           30  Apex Legends         5000

In [29]:
pd.concat([games, stats], axis=1)

   steam_appid          name  steam_appid  avg_players
0           10           CS2           10       110000
1           20        Dota 2           20        95000
2           30  Apex Legends           30         5000

# Column manipulation, filters and text tranformation

| Tarefa           | Método                             | Exemplo             |
| ---------------- | ---------------------------------- | ------------------- |
| Criar coluna     | `df['nova'] = ...`                 | derivar valores     |
| Renomear         | `df.rename(columns=...)`           | mudar nomes         |
| Remover          | `df.drop(columns=...)`             | excluir             |
| Filtrar linhas   | `df[...]`                          | condições           |
| Filtro por texto | `.str.contains()`                  | busca               |
| Filtro por lista | `.isin()`                          | múltiplos valores   |
| Padronizar texto | `.str.lower()`, `.str.strip()`     | limpeza             |
| Regex            | `.str.extract()`, `.str.replace()` | extração            |
| Aplicar função   | `.apply()`                         | regras customizadas |

In [30]:
df = pd.read_csv(f'{DATA_PATH}/raw/steamcharts.csv')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612265 entries, 0 to 612264
Data columns (total 7 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   month         612265 non-null  object
 1   avg_players   612265 non-null  float64
 2   gain          612265 non-null  object
 3   gain_percent  612265 non-null  float64
 4   peak_players  612265 non-null  int64
 5   name          612265 non-null  object
 6   steam_appid   612265 non-null  int64
dtypes: float64(2), int64(2), object(3)
memory usage: 32.7+ MB

In [32]:
df['players_diff'] = df['peak_players'] - df['avg_players']

In [33]:
df.rename(columns={'avg_players': 'average_players', 'peak_players': 'maximum_players'}, inplace=True)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612265 entries, 0 to 612264
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   month            612265 non-null  object
 1   average_players  612265 non-null  float64
 2   gain             612265 non-null  object
 3   gain_percent     612265 non-null  float64
 4   maximum_players  612265 non-null  int64
 5   name             612265 non-null  object
 6   steam_appid      612265 non-null  int64
 7   players_diff     612265 non-null  float64
dtypes: float64(3), int64(2), object(3)
memory usage: 37.4+ MB

# Optimization

In [34]:
df.dtypes

month               object
average_players    float64
gain                object
gain_percent       float64
maximum_players      int64
name                object
steam_appid          int64
players_diff       float64
dtype: object

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612265 entries, 0 to 612264
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   month            612265 non-null  object
 1   average_players  612265 non-null  float64
 2   gain             612265 non-null  object
 3   gain_percent     612265 non-null  float64
 4   maximum_players  612265 non-null  int64
 5   name             612265 non-null  object
 6   steam_appid      612265 non-null  int64
 7   players_diff     612265 non-null  float64
dtypes: float64(3), int64(2), object(3)
memory usage: 37.4+ MB

In [36]:
df['steam_appid'] = df['steam_appid'].astype('int32')
df['name'] = df['name'].astype('category')

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612265 entries, 0 to 612264
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   month            612265 non-null  object
 1   average_players  612265 non-null  float64
 2   gain             612265 non-null  object
 3   gain_percent     612265 non-null  float64
 4   maximum_players  612265 non-null  int64
 5   name             612265 non-null  category
 6   steam_appid      612265 non-null  int32
 7   players_diff     612265 non-null  float64
dtypes: category(1), float64(3), int32(1), int64(1), object(2)
memory usage: 31.8+ MB

In [38]:
df = pd.DataFrame({
    'A': [1, 4, 7],
    'B': [2, 5, 8],
    'C': [3, 6, 9]
})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [57]:
df.loc[0:1]

   A  B  C
0  1  2  3
1  4  5  6

In [59]:
df.iloc[0:2, 1]

0    2
1    5
Name: B, dtype: int64